dferbas/ethernut/nut/include/arch/cm3/stm/generated/stm32f446_pinmux.h
/* Do not edit!
 * Generated from /devel/cubemx/db/mcu/IPGPIO-STM32F446_gpio_v1_0_Modes.xml*/

#if !defined(_STM32F446_PINMUX_H_)
# define _STM32F446_PINMUX_H_

#define CAN1_RX_FUNC             0
#define CAN1_TX_FUNC             1
#define CAN2_RX_FUNC             2
#define CAN2_TX_FUNC             3
#define CEC_FUNC                 4
#define DCMI_D0_FUNC             5
#define DCMI_D1_FUNC             6
#define DCMI_D10_FUNC            7
#define DCMI_D11_FUNC            8
#define DCMI_D12_FUNC            9
#define DCMI_D13_FUNC            10
#define DCMI_D2_FUNC             11
#define DCMI_D3_FUNC             12
#define DCMI_D4_FUNC             13
#define DCMI_D5_FUNC             14
#define DCMI_D6_FUNC             15
#define DCMI_D7_FUNC             16
#define DCMI_D8_FUNC             17
#define DCMI_D9_FUNC             18
#define DCMI_HSYNC_FUNC          19
#define DCMI_PIXCLK_FUNC         20
#define DCMI_VSYNC_FUNC          21
#define FMC_A0_FUNC              22
#define FMC_A1_FUNC              23
#define FMC_A10_FUNC             24
#define FMC_A11_FUNC             25
#define FMC_A12_FUNC             26
#define FMC_A13_FUNC             27
#define FMC_A14_FUNC             28
#define FMC_A15_FUNC             29
#define FMC_A16_FUNC             30
#define FMC_A17_FUNC             31
#define FMC_A18_FUNC             32
#define FMC_A19_FUNC             33
#define FMC_A2_FUNC              34
#define FMC_A20_FUNC             35
#define FMC_A21_FUNC             36
#define FMC_A22_FUNC             37
#define FMC_A23_FUNC             38
#define FMC_A24_FUNC             39
#define FMC_A25_FUNC             40
#define FMC_A3_FUNC              41
#define FMC_A4_FUNC              42
#define FMC_A5_FUNC              43
#define FMC_A6_FUNC              44
#define FMC_A7_FUNC              45
#define FMC_A8_FUNC              46
#define FMC_A9_FUNC              47
#define FMC_BA0_FUNC             48
#define FMC_BA1_FUNC             49
#define FMC_CLK_FUNC             50
#define FMC_D0_FUNC              51
#define FMC_D1_FUNC              52
#define FMC_D10_FUNC             53
#define FMC_D11_FUNC             54
#define FMC_D12_FUNC             55
#define FMC_D13_FUNC             56
#define FMC_D14_FUNC             57
#define FMC_D15_FUNC             58
#define FMC_D2_FUNC              59
#define FMC_D3_FUNC              60
#define FMC_D4_FUNC              61
#define FMC_D5_FUNC              62
#define FMC_D6_FUNC              63
#define FMC_D7_FUNC              64
#define FMC_D8_FUNC              65
#define FMC_D9_FUNC              66
#define FMC_DA0_FUNC             67
#define FMC_DA1_FUNC             68
#define FMC_DA10_FUNC            69
#define FMC_DA11_FUNC            70
#define FMC_DA12_FUNC            71
#define FMC_DA13_FUNC            72
#define FMC_DA14_FUNC            73
#define FMC_DA15_FUNC            74
#define FMC_DA2_FUNC             75
#define FMC_DA3_FUNC             76
#define FMC_DA4_FUNC             77
#define FMC_DA5_FUNC             78
#define FMC_DA6_FUNC             79
#define FMC_DA7_FUNC             80
#define FMC_DA8_FUNC             81
#define FMC_DA9_FUNC             82
#define FMC_INT3_FUNC            83
#define FMC_NBL0_FUNC            84
#define FMC_NBL1_FUNC            85
#define FMC_NCE3_FUNC            86
#define FMC_NE1_FUNC             87
#define FMC_NE2_FUNC             88
#define FMC_NE3_FUNC             89
#define FMC_NE4_FUNC             90
#define FMC_NL_FUNC              91
#define FMC_NOE_FUNC             92
#define FMC_NWAIT_FUNC           93
#define FMC_NWE_FUNC             94
#define FMC_SDCKE0_FUNC          95
#define FMC_SDCKE1_FUNC          96
#define FMC_SDCLK_FUNC           97
#define FMC_SDNCAS_FUNC          98
#define FMC_SDNE0_FUNC           99
#define FMC_SDNE1_FUNC           100
#define FMC_SDNRAS_FUNC          101
#define FMC_SDNWE_FUNC           102
#define FMPI2C1_SCL_FUNC         103
#define FMPI2C1_SDA_FUNC         104
#define FMPI2C1_SMBA_FUNC        105
#define I2C1_SCL_FUNC            106
#define I2C1_SDA_FUNC            107
#define I2C1_SMBA_FUNC           108
#define I2C2_SCL_FUNC            109
#define I2C2_SDA_FUNC            110
#define I2C2_SMBA_FUNC           111
#define I2C3_SCL_FUNC            112
#define I2C3_SDA_FUNC            113
#define I2C3_SMBA_FUNC           114
#define I2S1_CK_FUNC             115
#define I2S1_MCK_FUNC            116
#define I2S1_SD_FUNC             117
#define I2S1_WS_FUNC             118
#define I2S2_CK_FUNC             119
#define I2S2_MCK_FUNC            120
#define I2S2_SD_FUNC             121
#define I2S2_WS_FUNC             122
#define I2S3_CK_FUNC             123
#define I2S3_MCK_FUNC            124
#define I2S3_SD_FUNC             125
#define I2S3_WS_FUNC             126
#define I2S_CKIN_FUNC            127
#define QUADSPI_BK1_IO0_FUNC     128
#define QUADSPI_BK1_IO1_FUNC     129
#define QUADSPI_BK1_IO2_FUNC     130
#define QUADSPI_BK1_IO3_FUNC     131
#define QUADSPI_BK1_NCS_FUNC     132
#define QUADSPI_BK2_IO0_FUNC     133
#define QUADSPI_BK2_IO1_FUNC     134
#define QUADSPI_BK2_IO2_FUNC     135
#define QUADSPI_BK2_IO3_FUNC     136
#define QUADSPI_BK2_NCS_FUNC     137
#define QUADSPI_CLK_FUNC         138
#define RCC_MCO_1_FUNC           139
#define RCC_MCO_2_FUNC           140
#define RTC_REFIN_FUNC           141
#define SAI1_FS_A_FUNC           142
#define SAI1_FS_B_FUNC           143
#define SAI1_MCLK_A_FUNC         144
#define SAI1_MCLK_B_FUNC         145
#define SAI1_SCK_A_FUNC          146
#define SAI1_SCK_B_FUNC          147
#define SAI1_SD_A_FUNC           148
#define SAI1_SD_B_FUNC           149
#define SAI2_FS_A_FUNC           150
#define SAI2_FS_B_FUNC           151
#define SAI2_MCLK_A_FUNC         152
#define SAI2_MCLK_B_FUNC         153
#define SAI2_SCK_A_FUNC          154
#define SAI2_SCK_B_FUNC          155
#define SAI2_SD_A_FUNC           156
#define SAI2_SD_B_FUNC           157
#define SDIO_CK_FUNC             158
#define SDIO_CMD_FUNC            159
#define SDIO_D0_FUNC             160
#define SDIO_D1_FUNC             161
#define SDIO_D2_FUNC             162
#define SDIO_D3_FUNC             163
#define SDIO_D4_FUNC             164
#define SDIO_D5_FUNC             165
#define SDIO_D6_FUNC             166
#define SDIO_D7_FUNC             167
#define SPDIFRX_IN0_FUNC         168
#define SPDIFRX_IN1_FUNC         169
#define SPDIFRX_IN2_FUNC         170
#define SPDIFRX_IN3_FUNC         171
#define SPI1_MISO_FUNC           172
#define SPI1_MOSI_FUNC           173
#define SPI1_NSS_FUNC            174
#define SPI1_SCK_FUNC            175
#define SPI2_MISO_FUNC           176
#define SPI2_MOSI_FUNC           177
#define SPI2_NSS_FUNC            178
#define SPI2_SCK_FUNC            179
#define SPI3_MISO_FUNC           180
#define SPI3_MOSI_FUNC           181
#define SPI3_NSS_FUNC            182
#define SPI3_SCK_FUNC            183
#define SPI4_MISO_FUNC           184
#define SPI4_MOSI_FUNC           185
#define SPI4_NSS_FUNC            186
#define SPI4_SCK_FUNC            187
#define SYS_JTCK_SWCLK_FUNC      188
#define SYS_JTDI_FUNC            189
#define SYS_JTDO_SWO_FUNC        190
#define SYS_JTMS_SWDIO_FUNC      191
#define SYS_JTRST_FUNC           192
#define SYS_TRACECLK_FUNC        193
#define SYS_TRACED0_FUNC         194
#define SYS_TRACED1_FUNC         195
#define SYS_TRACED2_FUNC         196
#define SYS_TRACED3_FUNC         197
#define TIM10_CH1_FUNC           198
#define TIM11_CH1_FUNC           199
#define TIM12_CH1_FUNC           200
#define TIM12_CH2_FUNC           201
#define TIM13_CH1_FUNC           202
#define TIM14_CH1_FUNC           203
#define TIM1_BKIN_FUNC           204
#define TIM1_CH1_FUNC            205
#define TIM1_CH1N_FUNC           206
#define TIM1_CH2_FUNC            207
#define TIM1_CH2N_FUNC           208
#define TIM1_CH3_FUNC            209
#define TIM1_CH3N_FUNC           210
#define TIM1_CH4_FUNC            211
#define TIM1_ETR_FUNC            212
#define TIM2_CH1_FUNC            213
#define TIM2_CH2_FUNC            214
#define TIM2_CH3_FUNC            215
#define TIM2_CH4_FUNC            216
#define TIM2_ETR_FUNC            217
#define TIM3_CH1_FUNC            218
#define TIM3_CH2_FUNC            219
#define TIM3_CH3_FUNC            220
#define TIM3_CH4_FUNC            221
#define TIM3_ETR_FUNC            222
#define TIM4_CH1_FUNC            223
#define TIM4_CH2_FUNC            224
#define TIM4_CH3_FUNC            225
#define TIM4_CH4_FUNC            226
#define TIM4_ETR_FUNC            227
#define TIM5_CH1_FUNC            228
#define TIM5_CH2_FUNC            229
#define TIM5_CH3_FUNC            230
#define TIM5_CH4_FUNC            231
#define TIM8_BKIN_FUNC           232
#define TIM8_CH1_FUNC            233
#define TIM8_CH1N_FUNC           234
#define TIM8_CH2_FUNC            235
#define TIM8_CH2N_FUNC           236
#define TIM8_CH3_FUNC            237
#define TIM8_CH3N_FUNC           238
#define TIM8_CH4_FUNC            239
#define TIM8_ETR_FUNC            240
#define TIM9_CH1_FUNC            241
#define TIM9_CH2_FUNC            242
#define UART4_CTS_FUNC           243
#define UART4_RTS_FUNC           244
#define UART4_RX_FUNC            245
#define UART4_TX_FUNC            246
#define UART5_CTS_FUNC           247
#define UART5_RTS_FUNC           248
#define UART5_RX_FUNC            249
#define UART5_TX_FUNC            250
#define USART1_CK_FUNC           251
#define UART1_CK_FUNC            251
#define USART1_CTS_FUNC          252
#define UART1_CTS_FUNC           252
#define USART1_RTS_FUNC          253
#define UART1_RTS_FUNC           253
#define USART1_RX_FUNC           254
#define UART1_RX_FUNC            254
#define USART1_TX_FUNC           255
#define UART1_TX_FUNC            255
#define USART2_CK_FUNC           256
#define UART2_CK_FUNC            256
#define USART2_CTS_FUNC          257
#define UART2_CTS_FUNC           257
#define USART2_RTS_FUNC          258
#define UART2_RTS_FUNC           258
#define USART2_RX_FUNC           259
#define UART2_RX_FUNC            259
#define USART2_TX_FUNC           260
#define UART2_TX_FUNC            260
#define USART3_CK_FUNC           261
#define UART3_CK_FUNC            261
#define USART3_CTS_FUNC          262
#define UART3_CTS_FUNC           262
#define USART3_RTS_FUNC          263
#define UART3_RTS_FUNC           263
#define USART3_RX_FUNC           264
#define UART3_RX_FUNC            264
#define USART3_TX_FUNC           265
#define UART3_TX_FUNC            265
#define USART6_CK_FUNC           266
#define UART6_CK_FUNC            266
#define USART6_CTS_FUNC          267
#define UART6_CTS_FUNC           267
#define USART6_RTS_FUNC          268
#define UART6_RTS_FUNC           268
#define USART6_RX_FUNC           269
#define UART6_RX_FUNC            269
#define USART6_TX_FUNC           270
#define UART6_TX_FUNC            270
#define USB_OTG_FS_DM_FUNC       271
#define USB_OTG_FS_DP_FUNC       272
#define USB_OTG_FS_ID_FUNC       273
#define USB_OTG_FS_SOF_FUNC      274
#define USB_OTG_HS_DM_FUNC       275
#define USB_OTG_HS_DP_FUNC       276
#define USB_OTG_HS_ID_FUNC       277
#define USB_OTG_HS_SOF_FUNC      278
#define USB_OTG_HS_ULPI_CK_FUNC  279
#define USB_OTG_HS_ULPI_D0_FUNC  280
#define USB_OTG_HS_ULPI_D1_FUNC  281
#define USB_OTG_HS_ULPI_D2_FUNC  282
#define USB_OTG_HS_ULPI_D3_FUNC  283
#define USB_OTG_HS_ULPI_D4_FUNC  284
#define USB_OTG_HS_ULPI_D5_FUNC  285
#define USB_OTG_HS_ULPI_D6_FUNC  286
#define USB_OTG_HS_ULPI_D7_FUNC  287
#define USB_OTG_HS_ULPI_DIR_FUNC 288
#define USB_OTG_HS_ULPI_NXT_FUNC 289
#define USB_OTG_HS_ULPI_STP_FUNC 290

