dferbas/ethernut/nut/include/arch/cm3/stm/generated/stm32f446_pinmux.h
	((gpio == PE04) && (func == SAI1_FS_A_FUNC           )) ?  6 : \
	((gpio == PE04) && (func == FMC_A20_FUNC             )) ? 12 : \
	((gpio == PE04) && (func == DCMI_D4_FUNC             )) ? 13 : \
	((gpio == PE05) && (func == SYS_TRACED2_FUNC         )) ?  0 : \
	((gpio == PE05) && (func == TIM9_CH1_FUNC            )) ?  3 : \
	((gpio == PE05) && (func == SPI4_MISO_FUNC           )) ?  5 : \
	((gpio == PE05) && (func == SAI1_SCK_A_FUNC          )) ?  6 : \
	((gpio == PE05) && (func == FMC_A21_FUNC             )) ? 12 : \
	((gpio == PE05) && (func == DCMI_D6_FUNC             )) ? 13 : \
	((gpio == PE06) && (func == SYS_TRACED3_FUNC         )) ?  0 : \
	((gpio == PE06) && (func == TIM9_CH2_FUNC            )) ?  3 : \
	((gpio == PE06) && (func == SPI4_MOSI_FUNC           )) ?  5 : \
	((gpio == PE06) && (func == SAI1_SD_A_FUNC           )) ?  6 : \
	((gpio == PE06) && (func == FMC_A22_FUNC             )) ? 12 : \
	((gpio == PE06) && (func == DCMI_D7_FUNC             )) ? 13 : \
	((gpio == PE07) && (func == TIM1_ETR_FUNC            )) ?  1 : \
	((gpio == PE07) && (func == UART5_RX_FUNC            )) ?  8 : \
	((gpio == PE07) && (func == QUADSPI_BK2_IO0_FUNC     )) ? 10 : \
	((gpio == PE07) && (func == FMC_D4_FUNC              )) ? 12 : \
	((gpio == PE07) && (func == FMC_DA4_FUNC             )) ? 12 : \
	((gpio == PE08) && (func == TIM1_CH1N_FUNC           )) ?  1 : \
	((gpio == PE08) && (func == UART5_TX_FUNC            )) ?  8 : \
	((gpio == PE08) && (func == QUADSPI_BK2_IO1_FUNC     )) ? 10 : \
	((gpio == PE08) && (func == FMC_D5_FUNC              )) ? 12 : \
	((gpio == PE08) && (func == FMC_DA5_FUNC             )) ? 12 : \
	((gpio == PE09) && (func == TIM1_CH1_FUNC            )) ?  1 : \
	((gpio == PE09) && (func == QUADSPI_BK2_IO2_FUNC     )) ? 10 : \
	((gpio == PE09) && (func == FMC_D6_FUNC              )) ? 12 : \
	((gpio == PE09) && (func == FMC_DA6_FUNC             )) ? 12 : \
	((gpio == PE10) && (func == TIM1_CH2N_FUNC           )) ?  1 : \
	((gpio == PE10) && (func == QUADSPI_BK2_IO3_FUNC     )) ? 10 : \
	((gpio == PE10) && (func == FMC_D7_FUNC              )) ? 12 : \
	((gpio == PE10) && (func == FMC_DA7_FUNC             )) ? 12 : \
	((gpio == PE11) && (func == TIM1_CH2_FUNC            )) ?  1 : \
	((gpio == PE11) && (func == SPI4_NSS_FUNC            )) ?  5 : \
	((gpio == PE11) && (func == SAI2_SD_B_FUNC           )) ? 10 : \
	((gpio == PE11) && (func == FMC_D8_FUNC              )) ? 12 : \
	((gpio == PE11) && (func == FMC_DA8_FUNC             )) ? 12 : \
	((gpio == PE12) && (func == TIM1_CH3N_FUNC           )) ?  1 : \
	((gpio == PE12) && (func == SPI4_SCK_FUNC            )) ?  5 : \
	((gpio == PE12) && (func == SAI2_SCK_B_FUNC          )) ? 10 : \
	((gpio == PE12) && (func == FMC_D9_FUNC              )) ? 12 : \
	((gpio == PE12) && (func == FMC_DA9_FUNC             )) ? 12 : \
	((gpio == PE13) && (func == TIM1_CH3_FUNC            )) ?  1 : \
	((gpio == PE13) && (func == SPI4_MISO_FUNC           )) ?  5 : \
	((gpio == PE13) && (func == SAI2_FS_B_FUNC           )) ? 10 : \
	((gpio == PE13) && (func == FMC_D10_FUNC             )) ? 12 : \
	((gpio == PE13) && (func == FMC_DA10_FUNC            )) ? 12 : \
	((gpio == PE14) && (func == TIM1_CH4_FUNC            )) ?  1 : \
	((gpio == PE14) && (func == SPI4_MOSI_FUNC           )) ?  5 : \
	((gpio == PE14) && (func == SAI2_MCLK_B_FUNC         )) ? 10 : \
	((gpio == PE14) && (func == FMC_D11_FUNC             )) ? 12 : \
	((gpio == PE14) && (func == FMC_DA11_FUNC            )) ? 12 : \
	((gpio == PE15) && (func == TIM1_BKIN_FUNC           )) ?  1 : \
	((gpio == PE15) && (func == FMC_D12_FUNC             )) ? 12 : \
	((gpio == PE15) && (func == FMC_DA12_FUNC            )) ? 12 : \
	((gpio == PF00) && (func == I2C2_SDA_FUNC            )) ?  4 : \
	((gpio == PF00) && (func == FMC_A0_FUNC              )) ? 12 : \
	((gpio == PF01) && (func == I2C2_SCL_FUNC            )) ?  4 : \
	((gpio == PF01) && (func == FMC_A1_FUNC              )) ? 12 : \
	((gpio == PF02) && (func == I2C2_SMBA_FUNC           )) ?  4 : \
	((gpio == PF02) && (func == FMC_A2_FUNC              )) ? 12 : \
	((gpio == PF03) && (func == FMC_A3_FUNC              )) ? 12 : \
	((gpio == PF04) && (func == FMC_A4_FUNC              )) ? 12 : \
	((gpio == PF05) && (func == FMC_A5_FUNC              )) ? 12 : \
	((gpio == PF06) && (func == TIM10_CH1_FUNC           )) ?  3 : \
	((gpio == PF06) && (func == SAI1_SD_B_FUNC           )) ?  6 : \
	((gpio == PF06) && (func == QUADSPI_BK1_IO3_FUNC     )) ?  9 : \
	((gpio == PF07) && (func == TIM11_CH1_FUNC           )) ?  3 : \
	((gpio == PF07) && (func == SAI1_MCLK_B_FUNC         )) ?  6 : \
	((gpio == PF07) && (func == QUADSPI_BK1_IO2_FUNC     )) ?  9 : \
	((gpio == PF08) && (func == SAI1_SCK_B_FUNC          )) ?  6 : \
	((gpio == PF08) && (func == TIM13_CH1_FUNC           )) ?  9 : \
	((gpio == PF08) && (func == QUADSPI_BK1_IO0_FUNC     )) ? 10 : \
	((gpio == PF09) && (func == SAI1_FS_B_FUNC           )) ?  6 : \
	((gpio == PF09) && (func == TIM14_CH1_FUNC           )) ?  9 : \
	((gpio == PF09) && (func == QUADSPI_BK1_IO1_FUNC     )) ? 10 : \
	((gpio == PF10) && (func == DCMI_D11_FUNC            )) ? 13 : \
	((gpio == PF11) && (func == SAI2_SD_B_FUNC           )) ? 10 : \
	((gpio == PF11) && (func == FMC_SDNRAS_FUNC          )) ? 12 : \
	((gpio == PF11) && (func == DCMI_D12_FUNC            )) ? 13 : \
	((gpio == PF12) && (func == FMC_A6_FUNC              )) ? 12 : \
	((gpio == PF13) && (func == FMPI2C1_SMBA_FUNC        )) ?  4 : \
	((gpio == PF13) && (func == FMC_A7_FUNC              )) ? 12 : \
	((gpio == PF14) && (func == FMPI2C1_SCL_FUNC         )) ?  4 : \
	((gpio == PF14) && (func == FMC_A8_FUNC              )) ? 12 : \
	((gpio == PF15) && (func == FMPI2C1_SDA_FUNC         )) ?  4 : \
	((gpio == PF15) && (func == FMC_A9_FUNC              )) ? 12 : \
	((gpio == PG00) && (func == FMC_A10_FUNC             )) ? 12 : \
	((gpio == PG01) && (func == FMC_A11_FUNC             )) ? 12 : \
	((gpio == PG02) && (func == FMC_A12_FUNC             )) ? 12 : \
	((gpio == PG03) && (func == FMC_A13_FUNC             )) ? 12 : \
	((gpio == PG04) && (func == FMC_A14_FUNC             )) ? 12 : \
	((gpio == PG04) && (func == FMC_BA0_FUNC             )) ? 12 : \
	((gpio == PG05) && (func == FMC_A15_FUNC             )) ? 12 : \
	((gpio == PG05) && (func == FMC_BA1_FUNC             )) ? 12 : \
	((gpio == PG06) && (func == QUADSPI_BK1_NCS_FUNC     )) ? 10 : \
	((gpio == PG06) && (func == DCMI_D12_FUNC            )) ? 13 : \
	((gpio == PG07) && (func == USART6_CK_FUNC           )) ?  8 : \
	((gpio == PG07) && (func == FMC_INT3_FUNC            )) ? 12 : \
	((gpio == PG07) && (func == DCMI_D13_FUNC            )) ? 13 : \
	((gpio == PG08) && (func == SPDIFRX_IN2_FUNC         )) ?  7 : \
	((gpio == PG08) && (func == USART6_RTS_FUNC          )) ?  8 : \
	((gpio == PG08) && (func == FMC_SDCLK_FUNC           )) ? 12 : \
	((gpio == PG09) && (func == SPDIFRX_IN3_FUNC         )) ?  7 : \
	((gpio == PG09) && (func == USART6_RX_FUNC           )) ?  8 : \
	((gpio == PG09) && (func == QUADSPI_BK2_IO2_FUNC     )) ?  9 : \
	((gpio == PG09) && (func == SAI2_FS_B_FUNC           )) ? 10 : \
	((gpio == PG09) && (func == FMC_NCE3_FUNC            )) ? 12 : \
	((gpio == PG09) && (func == FMC_NE2_FUNC             )) ? 12 : \
	((gpio == PG09) && (func == DCMI_VSYNC_FUNC          )) ? 13 : \
	((gpio == PG10) && (func == SAI2_SD_B_FUNC           )) ? 10 : \
	((gpio == PG10) && (func == FMC_NE3_FUNC             )) ? 12 : \
	((gpio == PG10) && (func == DCMI_D2_FUNC             )) ? 13 : \
	((gpio == PG11) && (func == SPI4_SCK_FUNC            )) ?  6 : \
	((gpio == PG11) && (func == SPDIFRX_IN0_FUNC         )) ?  7 : \
	((gpio == PG11) && (func == DCMI_D3_FUNC             )) ? 13 : \
	((gpio == PG12) && (func == SPI4_MISO_FUNC           )) ?  6 : \
	((gpio == PG12) && (func == SPDIFRX_IN1_FUNC         )) ?  7 : \
	((gpio == PG12) && (func == USART6_RTS_FUNC          )) ?  8 : \
	((gpio == PG12) && (func == FMC_NE4_FUNC             )) ? 12 : \
	((gpio == PG13) && (func == SYS_TRACED2_FUNC         )) ?  0 : \
	((gpio == PG13) && (func == SPI4_MOSI_FUNC           )) ?  6 : \
	((gpio == PG13) && (func == USART6_CTS_FUNC          )) ?  8 : \
	((gpio == PG13) && (func == FMC_A24_FUNC             )) ? 12 : \
	((gpio == PG14) && (func == SYS_TRACED3_FUNC         )) ?  0 : \
	((gpio == PG14) && (func == SPI4_NSS_FUNC            )) ?  6 : \
	((gpio == PG14) && (func == USART6_TX_FUNC           )) ?  8 : \
	((gpio == PG14) && (func == QUADSPI_BK2_IO3_FUNC     )) ?  9 : \
	((gpio == PG14) && (func == FMC_A25_FUNC             )) ? 12 : \
	((gpio == PG15) && (func == USART6_CTS_FUNC          )) ?  8 : \
	((gpio == PG15) && (func == FMC_SDNCAS_FUNC          )) ? 12 : \
	((gpio == PG15) && (func == DCMI_D13_FUNC            )) ? 13 : \
	AF_NO_SUCH_PINFUNC)

