dferbas/ethernut/nut/include/arch/cm3/stm/generated/stm32f446_pinmux.h
# define TIMERMUX(gpio, timer_nr, channel_nr) ((gpio == PIN_NONE) ? AF_PIN_NONE : 	\
	((gpio == PA00) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA00) && (timer_nr ==  5) && (channel_nr ==  1)) ?  2 : \
	((gpio == PA01) && (timer_nr ==  2) && (channel_nr ==  2)) ?  1 : \
	((gpio == PA01) && (timer_nr ==  5) && (channel_nr ==  2)) ?  2 : \
	((gpio == PA02) && (timer_nr ==  2) && (channel_nr ==  3)) ?  1 : \
	((gpio == PA02) && (timer_nr ==  5) && (channel_nr ==  3)) ?  2 : \
	((gpio == PA02) && (timer_nr ==  9) && (channel_nr ==  1)) ?  3 : \
	((gpio == PA03) && (timer_nr ==  2) && (channel_nr ==  4)) ?  1 : \
	((gpio == PA03) && (timer_nr ==  5) && (channel_nr ==  4)) ?  2 : \
	((gpio == PA03) && (timer_nr ==  9) && (channel_nr ==  2)) ?  3 : \
	((gpio == PA05) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA05) && (timer_nr ==  8) && (channel_nr == -1)) ?  3 : \
	((gpio == PA06) && (timer_nr ==  3) && (channel_nr ==  1)) ?  2 : \
	((gpio == PA06) && (timer_nr == 13) && (channel_nr ==  1)) ?  9 : \
	((gpio == PA07) && (timer_nr ==  1) && (channel_nr == -1)) ?  1 : \
	((gpio == PA07) && (timer_nr ==  3) && (channel_nr ==  2)) ?  2 : \
	((gpio == PA07) && (timer_nr ==  8) && (channel_nr == -1)) ?  3 : \
	((gpio == PA07) && (timer_nr == 14) && (channel_nr ==  1)) ?  9 : \
	((gpio == PA08) && (timer_nr ==  1) && (channel_nr ==  1)) ?  1 : \
	((gpio == PA09) && (timer_nr ==  1) && (channel_nr ==  2)) ?  1 : \
	((gpio == PA10) && (timer_nr ==  1) && (channel_nr ==  3)) ?  1 : \
	((gpio == PA11) && (timer_nr ==  1) && (channel_nr ==  4)) ?  1 : \
	((gpio == PA15) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PB00) && (timer_nr ==  1) && (channel_nr == -2)) ?  1 : \
	((gpio == PB00) && (timer_nr ==  3) && (channel_nr ==  3)) ?  2 : \
	((gpio == PB00) && (timer_nr ==  8) && (channel_nr == -2)) ?  3 : \
	((gpio == PB01) && (timer_nr ==  1) && (channel_nr == -3)) ?  1 : \
	((gpio == PB01) && (timer_nr ==  3) && (channel_nr ==  4)) ?  2 : \
	((gpio == PB01) && (timer_nr ==  8) && (channel_nr == -3)) ?  3 : \
	((gpio == PB02) && (timer_nr ==  2) && (channel_nr ==  4)) ?  1 : \
	((gpio == PB03) && (timer_nr ==  2) && (channel_nr ==  2)) ?  1 : \
	((gpio == PB04) && (timer_nr ==  3) && (channel_nr ==  1)) ?  2 : \
	((gpio == PB05) && (timer_nr ==  3) && (channel_nr ==  2)) ?  2 : \
	((gpio == PB06) && (timer_nr ==  4) && (channel_nr ==  1)) ?  2 : \
	((gpio == PB07) && (timer_nr ==  4) && (channel_nr ==  2)) ?  2 : \
	((gpio == PB08) && (timer_nr ==  2) && (channel_nr ==  1)) ?  1 : \
	((gpio == PB08) && (timer_nr ==  4) && (channel_nr ==  3)) ?  2 : \
	((gpio == PB08) && (timer_nr == 10) && (channel_nr ==  1)) ?  3 : \
	((gpio == PB09) && (timer_nr ==  2) && (channel_nr ==  2)) ?  1 : \
	((gpio == PB09) && (timer_nr ==  4) && (channel_nr ==  4)) ?  2 : \
	((gpio == PB09) && (timer_nr == 11) && (channel_nr ==  1)) ?  3 : \
	((gpio == PB10) && (timer_nr ==  2) && (channel_nr ==  3)) ?  1 : \
	((gpio == PB11) && (timer_nr ==  2) && (channel_nr ==  4)) ?  1 : \
	((gpio == PB13) && (timer_nr ==  1) && (channel_nr == -1)) ?  1 : \
	((gpio == PB14) && (timer_nr ==  1) && (channel_nr == -2)) ?  1 : \
	((gpio == PB14) && (timer_nr ==  8) && (channel_nr == -2)) ?  3 : \
	((gpio == PB14) && (timer_nr == 12) && (channel_nr ==  1)) ?  9 : \
	((gpio == PB15) && (timer_nr ==  1) && (channel_nr == -3)) ?  1 : \
	((gpio == PB15) && (timer_nr ==  8) && (channel_nr == -3)) ?  3 : \
	((gpio == PB15) && (timer_nr == 12) && (channel_nr ==  2)) ?  9 : \
	((gpio == PC06) && (timer_nr ==  3) && (channel_nr ==  1)) ?  2 : \
	((gpio == PC06) && (timer_nr ==  8) && (channel_nr ==  1)) ?  3 : \
	((gpio == PC07) && (timer_nr ==  3) && (channel_nr ==  2)) ?  2 : \
	((gpio == PC07) && (timer_nr ==  8) && (channel_nr ==  2)) ?  3 : \
	((gpio == PC08) && (timer_nr ==  3) && (channel_nr ==  3)) ?  2 : \
	((gpio == PC08) && (timer_nr ==  8) && (channel_nr ==  3)) ?  3 : \
	((gpio == PC09) && (timer_nr ==  3) && (channel_nr ==  4)) ?  2 : \
	((gpio == PC09) && (timer_nr ==  8) && (channel_nr ==  4)) ?  3 : \
	((gpio == PD12) && (timer_nr ==  4) && (channel_nr ==  1)) ?  2 : \
	((gpio == PD13) && (timer_nr ==  4) && (channel_nr ==  2)) ?  2 : \
	((gpio == PD14) && (timer_nr ==  4) && (channel_nr ==  3)) ?  2 : \
	((gpio == PD15) && (timer_nr ==  4) && (channel_nr ==  4)) ?  2 : \
	((gpio == PE05) && (timer_nr ==  9) && (channel_nr ==  1)) ?  3 : \
	((gpio == PE06) && (timer_nr ==  9) && (channel_nr ==  2)) ?  3 : \
	((gpio == PE08) && (timer_nr ==  1) && (channel_nr == -1)) ?  1 : \
	((gpio == PE09) && (timer_nr ==  1) && (channel_nr ==  1)) ?  1 : \
	((gpio == PE10) && (timer_nr ==  1) && (channel_nr == -2)) ?  1 : \
	((gpio == PE11) && (timer_nr ==  1) && (channel_nr ==  2)) ?  1 : \
	((gpio == PE12) && (timer_nr ==  1) && (channel_nr == -3)) ?  1 : \
	((gpio == PE13) && (timer_nr ==  1) && (channel_nr ==  3)) ?  1 : \
	((gpio == PE14) && (timer_nr ==  1) && (channel_nr ==  4)) ?  1 : \
	((gpio == PF06) && (timer_nr == 10) && (channel_nr ==  1)) ?  3 : \
	((gpio == PF07) && (timer_nr == 11) && (channel_nr ==  1)) ?  3 : \
	((gpio == PF08) && (timer_nr == 13) && (channel_nr ==  1)) ?  9 : \
	((gpio == PF09) && (timer_nr == 14) && (channel_nr ==  1)) ?  9 : \
	AF_NO_SUCH_PINFUNC)
#endif
